sunjinkun/GD32G5X3-/CMSIS/GD/GD32G5x3/Source/IAR/startup_gd32g5x3.s
        PUBWEAK SPI0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI0_IRQHandler
        B SPI0_IRQHandler

        PUBWEAK SPI1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI1_IRQHandler
        B SPI1_IRQHandler

        PUBWEAK USART0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USART0_IRQHandler
        B USART0_IRQHandler

        PUBWEAK USART1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USART1_IRQHandler
        B USART1_IRQHandler

        PUBWEAK USART2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USART2_IRQHandler
        B USART2_IRQHandler

        PUBWEAK EXTI10_15_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI10_15_IRQHandler
        B EXTI10_15_IRQHandler

        PUBWEAK RTC_Alarm_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RTC_Alarm_IRQHandler
        B RTC_Alarm_IRQHandler

        PUBWEAK TIMER7_BRK_TRS_IDX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_BRK_TRS_IDX_IRQHandler
        B TIMER7_BRK_TRS_IDX_IRQHandler

        PUBWEAK TIMER7_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_UP_IRQHandler
        B TIMER7_UP_IRQHandler

        PUBWEAK TIMER7_TRG_CMT_IDX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_TRG_CMT_IDX_IRQHandler
        B TIMER7_TRG_CMT_IDX_IRQHandler

        PUBWEAK TIMER7_Channel_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_Channel_IRQHandler
        B TIMER7_Channel_IRQHandler

        PUBWEAK ADC2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ADC2_IRQHandler
        B ADC2_IRQHandler

        PUBWEAK SYSCFG_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SYSCFG_IRQHandler
        B SYSCFG_IRQHandler

        PUBWEAK LPTIMER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPTIMER_IRQHandler
        B LPTIMER_IRQHandler

        PUBWEAK TIMER4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER4_IRQHandler
        B TIMER4_IRQHandler

        PUBWEAK SPI2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI2_IRQHandler
        B SPI2_IRQHandler

        PUBWEAK UART3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
UART3_IRQHandler
        B UART3_IRQHandler

        PUBWEAK UART4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
UART4_IRQHandler
        B UART4_IRQHandler

        PUBWEAK TIMER5_DAC0_2_UDR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER5_DAC0_2_UDR_IRQHandler
        B TIMER5_DAC0_2_UDR_IRQHandler

        PUBWEAK TIMER6_DAC1_3_UDR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER6_DAC1_3_UDR_IRQHandler
        B TIMER6_DAC1_3_UDR_IRQHandler

        PUBWEAK DMA1_Channel0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel0_IRQHandler
        B DMA1_Channel0_IRQHandler

        PUBWEAK DMA1_Channel1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel1_IRQHandler
        B DMA1_Channel1_IRQHandler

        PUBWEAK DMA1_Channel2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel2_IRQHandler
        B DMA1_Channel2_IRQHandler

        PUBWEAK DMA1_Channel3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel3_IRQHandler
        B DMA1_Channel3_IRQHandler

        PUBWEAK DMA1_Channel4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel4_IRQHandler
        B DMA1_Channel4_IRQHandler

        PUBWEAK ADC3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ADC3_IRQHandler
        B ADC3_IRQHandler

        PUBWEAK VUVD1_VOVD1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
VUVD1_VOVD1_IRQHandler
        B VUVD1_VOVD1_IRQHandler

        PUBWEAK CMP0_3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CMP0_3_IRQHandler
        B CMP0_3_IRQHandler

        PUBWEAK CMP4_7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CMP4_7_IRQHandler
        B CMP4_7_IRQHandler

        PUBWEAK CMP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CMP_IRQHandler
        B CMP_IRQHandler

        PUBWEAK HRTIMER_IRQ0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HRTIMER_IRQ0_IRQHandler
        B HRTIMER_IRQ0_IRQHandler

        PUBWEAK HRTIMER_IRQ1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HRTIMER_IRQ1_IRQHandler
        B HRTIMER_IRQ1_IRQHandler

        PUBWEAK HRTIMER_IRQ2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HRTIMER_IRQ2_IRQHandler
        B HRTIMER_IRQ2_IRQHandler

        PUBWEAK HRTIMER_IRQ3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HRTIMER_IRQ3_IRQHandler
        B HRTIMER_IRQ3_IRQHandler

        PUBWEAK HRTIMER_IRQ4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HRTIMER_IRQ4_IRQHandler
        B HRTIMER_IRQ4_IRQHandler

        PUBWEAK HRTIMER_IRQ5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HRTIMER_IRQ5_IRQHandler
        B HRTIMER_IRQ5_IRQHandler

        PUBWEAK HRTIMER_IRQ6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HRTIMER_IRQ6_IRQHandler
        B HRTIMER_IRQ6_IRQHandler

        PUBWEAK HRTIMER_IRQ7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HRTIMER_IRQ7_IRQHandler
        B HRTIMER_IRQ7_IRQHandler

        PUBWEAK HRTIMER_IRQ8_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HRTIMER_IRQ8_IRQHandler
        B HRTIMER_IRQ8_IRQHandler

        PUBWEAK HRTIMER_IRQ9_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HRTIMER_IRQ9_IRQHandler
        B HRTIMER_IRQ9_IRQHandler

        PUBWEAK TIMER19_BRK_TRS_IDX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER19_BRK_TRS_IDX_IRQHandler
        B TIMER19_BRK_TRS_IDX_IRQHandler

        PUBWEAK TIMER19_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER19_UP_IRQHandler
        B TIMER19_UP_IRQHandler

        PUBWEAK TIMER19_TRG_CMT_IDX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER19_TRG_CMT_IDX_IRQHandler
        B TIMER19_TRG_CMT_IDX_IRQHandler

        PUBWEAK TIMER19_Channel_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER19_Channel_IRQHandler
        B TIMER19_Channel_IRQHandler

        PUBWEAK FPU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FPU_IRQHandler
        B FPU_IRQHandler

        PUBWEAK I2C2_EV_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C2_EV_WKUP_IRQHandler
        B I2C2_EV_WKUP_IRQHandler

        PUBWEAK I2C2_ER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C2_ER_IRQHandler
        B I2C2_ER_IRQHandler

        PUBWEAK CAU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAU_IRQHandler
        B CAU_IRQHandler

